In [200]:
import pandas as pd
df = pd.read_excel('albumy.xlsx')

In [201]:
df.set_index('POS', inplace=True)

#### 1. Zmiana nagłówków

In [202]:
df.rename(columns={'TITLE':'TYTUŁ','ARTIST':'ARTYSTA','YEAR':'ROK','HIGH POSN':'MAX POZ'}, inplace=True)
df.head()

                                    TYTUŁ  ARTYSTA   ROK  MAX POZ
POS
1                           GREATEST HITS    QUEEN  1981        1
2                    GOLD - GREATEST HITS     ABBA  1992        1
3    SGT PEPPER'S LONELY HEARTS CLUB BAND  BEATLES  1967        1
4                                      21    ADELE  2011        1
5          WHAT'S THE STORY MORNING GLORY    OASIS  1995        1

#### 2. Mamy 47 pojedyńczych artystów

In [203]:
df['ARTYSTA'].nunique()

47

##### 3. Najczęściej na liście pojawił się 'ColdPlay' oraz 'Take That'

In [204]:
df['ARTYSTA'].value_counts().head()

COLDPLAY     3
TAKE THAT    3
QUEEN        2
ADELE        2
BEATLES      2
Name: ARTYSTA, dtype: int64

#### 4. Zmiana nagłówków

In [205]:
df.rename(str.capitalize, axis='columns', inplace=True)
df.head()

                                    Tytuł  Artysta   Rok  Max poz
POS
1                           GREATEST HITS    QUEEN  1981        1
2                    GOLD - GREATEST HITS     ABBA  1992        1
3    SGT PEPPER'S LONELY HEARTS CLUB BAND  BEATLES  1967        1
4                                      21    ADELE  2011        1
5          WHAT'S THE STORY MORNING GLORY    OASIS  1995        1

#### 5. Usunięta kolumna 'Max poz'

In [206]:
df.drop('Max poz', axis=1, inplace=True)
df.head()

                                    Tytuł  Artysta   Rok
POS
1                           GREATEST HITS    QUEEN  1981
2                    GOLD - GREATEST HITS     ABBA  1992
3    SGT PEPPER'S LONELY HEARTS CLUB BAND  BEATLES  1967
4                                      21    ADELE  2011
5          WHAT'S THE STORY MORNING GLORY    OASIS  1995

#### 6. Najwięcej albumów z listy wyszło w 2000 oraz 1987 roku

In [207]:
df.groupby('Rok').count().sort_values(by='Tytuł', ascending=False).head()

      Tytuł  Artysta
Rok
2000      4        4
1987      4        4
1998      3        3
2006      3        3
1997      3        3

In [208]:
# df['Rok'] = pd.to_datetime(df['Rok'])
df['Rok'] = pd.to_datetime(df['Rok'], format='%Y')
df.head()

                                    Tytuł  Artysta        Rok
POS
1                           GREATEST HITS    QUEEN 1981-01-01
2                    GOLD - GREATEST HITS     ABBA 1992-01-01
3    SGT PEPPER'S LONELY HEARTS CLUB BAND  BEATLES 1967-01-01
4                                      21    ADELE 2011-01-01
5          WHAT'S THE STORY MORNING GLORY    OASIS 1995-01-01

#### 7. Pomiędzy 1960 a 1990 znajdują się 22 albumy

In [209]:
df[(df['Rok'] >= '1960-01-01') & (df['Rok'] <= '1990-12-31')].count()

Tytuł      22
Artysta    22
Rok        22
dtype: int64

#### 8. Najmłodzy album na liście został wydany w 1965 roku

In [222]:
df.sort_values(by='Rok', ascending=True).head()

                                    Tytuł                  Artysta        Rok
POS
52                     THE SOUND OF MUSIC  ORIGINAL CAST RECORDING 1965-01-01
3    SGT PEPPER'S LONELY HEARTS CLUB BAND                  BEATLES 1967-01-01
21             BRIDGE OVER TROUBLED WATER        SIMON & GARFUNKEL 1970-01-01
7               THE DARK SIDE OF THE MOON               PINK FLOYD 1973-01-01
42                          TUBULAR BELLS            MIKE OLDFIELD 1973-01-01

#### 9. Lista najwczęsniej wydanych albumów po artystach

In [221]:
df.groupby(['Artysta','Tytuł']).apply(lambda x: x.sort_values(by='Rok', ascending=False)).head(5)

                                                           Tytuł  \
Artysta           Tytuł                POS
ABBA              GOLD - GREATEST HITS 2    GOLD - GREATEST HITS
                  GREATEST HITS        46          GREATEST HITS
ADELE             21                   4                      21
                  25                   27                     25
ALANIS MORISSETTE JAGGED LITTLE PILL   41     JAGGED LITTLE PILL

                                                      Artysta        Rok
Artysta           Tytuł                POS
ABBA              GOLD - GREATEST HITS 2                 ABBA 1992-01-01
                  GREATEST HITS        46                ABBA 1975-01-01
ADELE             21                   4                ADELE 2011-01-01
                  25                   27               ADELE 2015-01-01
ALANIS MORISSETTE JAGGED LITTLE PILL   41   ALANIS MORISSETTE 1995-01-01

#### 10. Lista zapisana do CSV

In [ ]:
list = df.groupby(['Artysta','Tytuł']).apply(lambda x: x.sort_values(by='Rok', ascending=False))
list.to_csv('Lista_artystow_po_latach.csv')